<a href="https://colab.research.google.com/github/SoumyadeepDebnath/Data-Engineering/blob/main/11.%20SQL_Basics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#### **Database**

In [ ]:
#CREATE DATABASE database_name;
	
CREATE DATABASE Company;

In [ ]:
#DROP DATABASE database_name;
	
DROP DATABASE Company;

#### **Table**

In [ ]:
"""
CREATE TABLE table_name
(
column_name1 data_type [column1 constraint(s)],
column_name2 data_type [column2 constraint(s)],
.....,  
column_nameN data_type [columnN constraint(s)],
PRIMARY KEY(one or more col)
);
"""

CREATE TABLE Employee_details(
    Emp_Id NUMBER(4) NOT NULL,
    First_name VARCHAR(30),
    Last_name VARCHAR(30),
    Salary Money,
    City VARCHAR(30),
    PRIMARY KEY (Emp_Id)
);

In [ ]:
"""
ALTER TABLE table_name ADD column_name datatype [columnN constraint(s)];
ALTER TABLE table_name MODIFY column_name column_datatype;
ALTER TABLE table_name DROP COLUMN column_name;
"""

In [ ]:
"""
DROP TABLE [ IF EXISTS ]
table_name1, table_name2, ……, table_nameN;
"""

DROP TABLE Employee_details, Company_details;

#### **Record / Row**

In [ ]:
"""
INSERT INTO table_name  
(column_name1, column_name2, .…, column_nameN)  
VALUES (value_1, value_2, ..…, value_N), (value_1, value_2, ..…, value_N);
"""

INSERT INTO Employee_details  
(Emp_ID, Name)
VALUES (101, Akhil);

In [ ]:
"""
SELECT column_name1, column_name2, .…, column_nameN
FROM table_name
    [ WHERE condition ]
    [ ORDER BY order_column_name1 [ ASC | DESC ], .... ];
"""

SELECT Emp_ID, First_Name, Last_Name, Salary, City
FROM Employee_details
WHERE Salary = 100000
ORDER BY Last_Name;


"""
SELECT DISTINCT column_name1, column_name2, ...
FROM table_name;
    [ WHERE condition ]
    [ ORDER BY order_column_name1 [ ASC | DESC ], .... ];
"""

SELECT DISTINCT Emp_ID, First_Name, Last_Name, Salary, City
FROM Employee_details

In [ ]:
"""
UPDATE table_name
SET column_name1 = new_value_1, column_name2 = new_value_2, ...., column_nameN = new_value_N  
    [ WHERE  condition ];
"""

UPDATE Employee_details
SET Salary = 100000
WHERE Emp_ID = 10;

In [ ]:
"""
DELETE FROM table_name
WHERE CONDITION;
"""

DELETE FROM Employee_details  
WHERE First_Name = 'Sumit';

In [ ]:
#TRUNCATE TABLE table_name;

TRUNCATE TABLE Employee_details;